'''
Created on 2019. 7. 8.

@author: gd_4

printex1.py : print 함수 정리.
'''
print(10, 20, 30, 40 ,50)
print("안녕 ", "내 이름은 ", "홍길동이야.")
print('문자열은 ', "작은 따옴표도 ", '가능해')
print("홍길동이 인사를 합니다. '안녕'")
print('홍길동이 인사를 합니다. \'안녕\'')
print("홍길동이 인사를 합니다. \"안녕\"")
print('홍길동이 인사를 합니다. "안녕"')
print("동해물과 백두산이 마르고 닳도록 "
      "하느님이 보우하사 우리 나라 만세 "
      "무궁화 삼천리 화려강산 ")
print("""동해물과 백두산이 마르고 닳도록 
하느님이 보우하사 우리 나라 만세 
무궁화 삼천리 화려강산 """)  # """ """ 여러 줄에 걸쳐 작성할 때 하나의 문자열로 인식.
print('''동해물과 백두산이 마르고 닳도록 
하느님이 보우하사 우리 나라 만세 
무궁화 삼천리 화려강산 ''')  # 이 때는 주석이 아닌 문자열로 인식.